Tekla Open API Reference for Tekla Structures 2025
Events.DrawingUpdatedDelegate Delegate
 The delegate to use for drawing updated (insertion, deletion or modification).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void DrawingUpdatedDelegate(
	Drawing drawing,
	Events.DrawingUpdateTypeEnum type
)
Public Delegate Sub DrawingUpdatedDelegate (
	drawing As Drawing,
	type As Events.DrawingUpdateTypeEnum
)
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
type
Type: Tekla.Structures.Drawing.Events.DrawingUpdateTypeEnum
See Also
Reference
Tekla.Structures.Drawing Namespace